In [1]:
import matplotlib as plt
import numpy as np
import pandas as pd

In [5]:
data = pd.Series([1,2,3,4,5] , index=['a','b','c','d','e'])
data

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [6]:
data = pd.DataFrame([1,2,3,4,5])
data

   0
0  1
1  2
2  3
3  4
4  5

In [12]:
lst = [[1,2,3,4,5],[3,6,9,12,15]]
df = pd.DataFrame(lst)
df

   0  1  2   3   4
0  1  2  3   4   5
1  3  6  9  12  15

In [17]:
dict = {'name':['kamal','saman','nimal'], 'marks':[80,60,70]}
df = pd.DataFrame(dict)
df

    name  marks
0  kamal     80
1  saman     60
2  nimal     70

In [22]:
dict1 = {'kamal':[1,2,3,4],'nimal':[5,6,7,8]}
df1 = pd.DataFrame(dict1)
dict2 = {'saman':[9,10,11,12],'kumara':[12,13,14,15]}
df2 = pd.DataFrame(dict2)

In [23]:
df1

   kamal  nimal
0      1      5
1      2      6
2      3      7
3      4      8

In [24]:
df2

   saman  kumara
0      9      12
1     10      13
2     11      14
3     12      15

In [26]:
pd.concat([df1,df2], axis = 1)

   kamal  nimal  saman  kumara
0      1      5      9      12
1      2      6     10      13
2      3      7     11      14
3      4      8     12      15